<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Глава 1.</title>
</head>
<body>
    <h2>Примеры с пояснениями.</h2>
    <p>Обсуждаем использование програмного обеспечения</p>
    <p>Так-же анализируем принципы создания программ на PHP</p>
    <br>
    <hr>
    <h2>Програмный код</h2>
    <p>Программа в PHP -- зто набор инструкций выполняемые интерпритатором</p>
    <p>Данные интсрукции должны оформлены правильно для последующей
    коректной передачи интерпритатору чтобы уже он их выполнил правильно</p>
<hr>
    <p>
        Рассмотрим первый пример, Типичный и банальный 
        применяемый почти во всех языках программирования.
    </p>
    <?php
    print ("Hello world PHP!!!");
    ?>
    <p>Давайте разберем этот пример.</p>
    <p> <strong><?php </strong> -- это программа начинается инструкцией </p>
    <p><strong>?></strong> -- это конец инструкции</p>
    <p>То что находится внутри между ними являются команды для выполнения</p>
    <p>Все это обычное состояниея практически для всего языка PHP </p>
    <p>Здесь в нашем случае команда всего одна, это встроеннная команда <strong>print ()</strong></p>
    <p>аргументом которой является текст "Hello world PHP!!!" </p>
    
</body>
</html>