<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <style>
    body {
        background-color: wheat;
    }

    pre {
        color: red;
    }   
    </style>
    <title>Глава 5.</title>
</head>
<body>
    <h1>Функции</h1>
    <p>
        Функции в PHP помогают делать код структурированным и упорядоченным. Делая 
        его более удобным для чтения и работы. Также помогают ипользовать код повторно.
    </p>
    <p>
        Ф-ии в PHP создаются с ключего слова function далее идет имя ф-и затем параметры
        в круглых скобках(если они есть, иногда могут быть и пустыми). В круглых скобках
        параметров/аргументов может быть несколько. В этом случае они указываются через
        запятую.
    </p>
    <p>
        
    </p>
</body>
</html>