<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Глава 4.</title>
</head>
<body>
    <h1>Глава 4</h1>
    <h2>Массивы</h2>
    <p>
    Массивы в PHP представляют собой инструмент для хранения, обработки и управления
    данными. Они позволяют организовывать информацию в упорядоченные коллекции и 
    обращаться к ней по ключу или индексу. В PHP есть несколько типов массивов,
    включая индексированные и ассоциативные массивы, а также многомерные и 
    вложенные массивы, которые обеспечивают гибкость при работе с данными 
    различной структуры.
    </p>
</body>
</html>