<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <style>
    body {
        background-color: wheat;
        color: black;
    }

    pre {
        color: red;
    }

    .ul pre {
        font-size: 18px;
        color: black;
    }
    
    </style>
    <title>Глава. 7</title>
</head>
<body>
    <h1>Классы и объекты.</h1>
    <h2>Принципы ООП.</h2>
<p>
    Объектно-ориентированное программирование (ООП) — это методология программирования, 
    основанная на представлении программы в виде совокупности объектов, каждый из которых 
    является экземпляром определённого класса, а классы образуют иерархию наследования. 
    ООП позволяет моделировать реальные сущности и процессы, представляя их в виде объектов,
    которые взаимодействуют друг с другом, посылая сообщения.
</p>
<p>
Основные принципы ООП включают:
</p>
<ul>
<li>
    Инкапсуляцию — объединение данных и методов внутри объекта, обеспечивая защиту данных 
    от несанкционированного доступа.
</li>
<li>
    Наследование — возможность создания новых классов на основе существующих, наследуя их 
    свойства и методы.
</li>
<li>
    Полиморфизм — возможность использования одного и того же имени метода для 
    различных действий в зависимости от типа объекта.
</li>
</ul>
<p>Принципы ООП разрабатывались для больших программ.</p>
<p>Большая программа это несколько тысящ строк кода.</p>
<p>Программа написаная в рамках ООП подразумевает за собой создание объектов.</p>
<p>Объекты создаются на основе шаблонов. И они соответственно называютя классами.</p>
<br>
<p>
    Вернемся к инкапсуляции, наследовании и полиморфизму.Это три базовых мехнизма OOP.
</p>
<p>
    Инкапсуляция подразумевает за собой что данные и код для из обработки объединяются в одно 
    целое в объект.
</p>
<p>
    Наследование позволяет создавать новые классы используя существующие и наследуя их св-ва.  
</p>
<p>
    Полиморфизм - это использование универсальных интерфейсов взаимодействия с объектами, функциями и 
    методами.
</p>
</body>
</html>